       class-id ClassLibrary1.Class1.
       
       working-storage section.

       method-id InstanceMethod.
       local-storage section.
       procedure division.
           display "hello babaca".

           goback.
       end method.

       end class.
